In [1]:
import pandas as pd
import sklearn
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder
from sklearn.linear_model import LinearRegression
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.metrics import mean_squared_error

In [23]:
datadf = pd.read_csv("ai-jobs-net-salaries.csv")

In [24]:
datadf.head(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,MI,FT,Research Engineer,55000,EUR,57894,BE,50,BE,L
1,2025,EN,FT,Data Analyst,147000,USD,147000,US,0,US,M
2,2025,EN,FT,Data Analyst,60900,USD,60900,US,0,US,M
3,2025,SE,FT,Software Engineer,303500,USD,303500,US,0,US,M
4,2025,SE,FT,Software Engineer,159800,USD,159800,US,0,US,M
5,2025,SE,FT,Developer,135000,USD,135000,US,0,US,M
6,2025,SE,FT,Developer,95000,USD,95000,US,0,US,M
7,2025,SE,FT,Engineer,300000,USD,300000,US,0,US,M
8,2025,SE,FT,Engineer,70000,USD,70000,US,0,US,M
9,2025,MI,FT,Machine Learning Engineer,355000,USD,355000,US,0,US,M

In [25]:
datadf.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [29]:
#replacing the values to expand for better understanding
datadf['experience_level'] = datadf['experience_level'].replace({
    'EN': 'Entry-level',
    'MI': 'Mid-level',
    'SE': 'Senior-level',
    'EX': 'Executive-level'
})

In [28]:
datadf['experience_level'].unique()

array(['Mid-level', 'Entry-level', 'Senior-level', 'Executive-level'],
      dtype=object)

In [33]:

datadf['employment_type'].unique()

array(['FT', 'CT', 'PT', 'FL'], dtype=object)

In [34]:
#replacing the values to expand for better understanding
datadf['employment_type'] = datadf['employment_type'].replace({
    'FT': 'Full-Time',
    'CT': 'Contract',
    'PT': 'Part-Time',
    'FL': 'Freelance'
})

In [35]:
datadf['employment_type'].unique()

array(['Full-Time', 'Contract', 'Part-Time', 'Freelance'], dtype=object)

In [30]:
datadf['experience_level'].unique()

array(['Mid-level', 'Entry-level', 'Senior-level', 'Executive-level'],
      dtype=object)

In [36]:

datadf['remote_ratio'].unique()

array([ 50,   0, 100], dtype=int64)

In [32]:
datadf.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,Mid-level,FT,Research Engineer,55000,EUR,57894,BE,50,BE,L
1,2025,Entry-level,FT,Data Analyst,147000,USD,147000,US,0,US,M
2,2025,Entry-level,FT,Data Analyst,60900,USD,60900,US,0,US,M
3,2025,Senior-level,FT,Software Engineer,303500,USD,303500,US,0,US,M
4,2025,Senior-level,FT,Software Engineer,159800,USD,159800,US,0,US,M